TIM7040/week5/main.org
#+TITLE: IT Policies for a Mid-sized Regional Health Insurance company
#+INCLUDE: ./preamble.org
#+LATEX: \maketitle

* Introduction

The following IT policies will form the basis IT policy framework for our corporation. Like many companies in the IT health care space, our company is concerned with big-data analytics as a means of controlling costs and gaining competitive advantage citep:milenkovicBigDataAnalytics2019,dolezelBigDataAnalytics2019; focusing on cloud computing as a means of increasing innovation citep:linCloudComputingInnovation2012,mallmannAdoptionCloudComputing2018,karunagaranDifferentialCloudAdoption2019, as well as increasing reliability and performance at reduced cost citep:andradePerformabilityEvaluationCloudBased2019,khayerCloudComputingAdoption2020. Therefore our policies should reflect the needed security and operational concerns of a distributed environment that is hosted in a hybrid cloud environment.

* Policies

** Acceptable Computer Use Policy

- Applies to: All employees
- Policy Number: 002
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Information Security
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security, information access, device access, and technology utilization.


*** Policy

**** Scope

This policy applies to all employees, contractors, and other workers. It establishes the minimum requirements for accessing, using, or interacting with any corporate owned, managed, or contracted device, or other third-party information or technology system, and when personnel use any device while performing company directed work. Additional requirements may be imposed by federal, state, or local laws, rules, regulations, policies, or processes. Personnel must comply with whichever requirements are most confining.

This policy may not and does not override any applicable data privacy laws or data protection laws or any applicable regulations in any jurisdictions wherein the company operates and all such laws, regulations, and statutory requirements are considered to be binding in addition to this policy.

This policy specifically excludes employees of third-party sub-contractors who have explicit contractual relationships with the company to ensure their own employee non-disclosure and proper-use policies are enforced. Such exclusions will be noted by the legal team within the appropriate contractual relationshp and will be tracked in the contractor portal.

***** Exceptions:

On rare occasions it may be necessary to grant exceptions to this policy, in those instances Information Security may grant exceptions as per the general security exception policy.

***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here

**** Expectations

Personnel are expected to act lawfully and in compliance with all applicable regulations at all times. They are expected to exercise sound judgment and to not act in a way which may endanger the good name of the company or endanger the reputation of any company client, staff, providers, or other 3rd party entities. Personnel are expected to conform to the code of ethics at all times and to act with the best interest of the company in mind.

Specific prohibitions include:

- Any conduct that violates any Federal, State, or Local law, regulation, policy, or established ethical practice
- Accessing the internet or technology for unlawful purposes (examples include violating copyright, or personal financial gain such as mining digital currency)
- Accessing, downloading, or distributing pornographic, obscene, defamatory, discriminatory, harassing, or otherwise inappropriate materials
- Installing, using, or accessing any third-party software or technology not approved by the company to store, transfer, or process company data or information
- Conducting unauthorized vulnerability assessments, penetration tests, network probes or otherwise attempting to exploit, examine, or abuse system security measures
- Gaining unauthorized access of any kind to any system or technology
- Threaten the reputation of the company through personal actions which could be construed as libelous, slanderous, defamatory, threatening, exploitative, abusive, or otherwise inappropriate

**** Devices and Technology

***** Provisioning and Use

Only company provided and approved devices, systems, and technology will be connected to the company network and corporate systems. Any devices that is lost, stolen, or misplaced will be immediately reported to information security.

***** Using Devices

- Personnel are required to keep provided systems compliant with security policies, patches, software updates, configurations, encryption standards, patching levels, anti-virus signatures, data-loss prevention systems, etc. This list is non-exhaustive.
- Any non-compliant configuration must be remediated within 5 business days or it will be disabled at the next automated system scan and will be required to be brought to the system security desk for re-enablement. This event will be noted in the employee personnel file.
- Passwords and passcodes must meet the security standards published and maintained by the information security team.
- Mobile devices are limited to being used for email, voice, instant messaging, and browser-based access to corproate vpn systems.
- All devices must be encrypted
- Devices wwith screen locks will have such locks enabled whenever not in use

- Personal Use
  Subject to the restrictions of this policy, personnel may use company provided devices for personal use provided such use:
  - Does not interefere with on-going work
  - Does not adversely impact the proper handling of company data or information
  - Does not create adverse load on company network or technology assets

