TIM7040/week5/main.tex
% Created 2021-08-28 Sat 16:00
% Intended LaTeX compiler: pdflatex
\documentclass[stu]{apa7}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{hyperref}
\usepackage{fontawesome}
\usepackage{csquotes}
\usepackage{hhline}
\usepackage{colortbl}
\usepackage{arydshln}
\usepackage{caption}
\usepackage[utf8]{inputenc}
\usepackage[gen]{eurosym}
\usepackage[style=apa,sortcites=true,sorting=nyt,backend=biber,natbib=true]{biblatex}
\DeclareLanguageMapping{american}{american-apa}
\addbibresource{/home/david/Dropbox/Org/References/bibliography2.bib}
\title{Development of an Efficient Centralized Policy Management System}
\author{David Wagle}
\course{TIM-7040 V3: Technology Policy and Strategy}
\professor{Dr. Dani Babb}
\affiliation{School of Business, Northcentral University}
\duedate{Aug 17, 20121}
\leftheader{Wagle}
\author{David Wagle}
\date{\today}
\title{IT Policies for a Mid-sized Regional Health Insurance company}
\hypersetup{
 pdfauthor={David Wagle},
 pdftitle={IT Policies for a Mid-sized Regional Health Insurance company},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\maketitle

\section{Introduction}
\label{sec:orgbd96d16}

The following IT policies will form the basis IT policy framework for our corporation. Like many companies in the IT health care space, our company is concerned with big-data analytics as a means of controlling costs and gaining competitive advantage \citep{milenkovicBigDataAnalytics2019,dolezelBigDataAnalytics2019}; focusing on cloud computing as a means of increasing innovation \citep{linCloudComputingInnovation2012,mallmannAdoptionCloudComputing2018,karunagaranDifferentialCloudAdoption2019}, as well as increasing reliability and performance at reduced cost \citep{andradePerformabilityEvaluationCloudBased2019,khayerCloudComputingAdoption2020}. Therefore our policies should reflect the needed security and operational concerns of a distributed environment that is hosted in a hybrid cloud environment.

\section{Policies}
\label{sec:orgee837a6}

\subsection{Acceptable Computer Use Policy}
\label{sec:org9821602}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 002
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Information Security
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:org80f86d9}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org4cdb1be}

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security, information access, device access, and technology utilization.


\subsubsection{Policy}
\label{sec:org7200004}

\begin{enumerate}
\item Scope
\label{sec:orgd421bed}

This policy applies to all employees, contractors, and other workers. It establishes the minimum requirements for accessing, using, or interacting with any corporate owned, managed, or contracted device, or other third-party information or technology system, and when personnel use any device while performing company directed work. Additional requirements may be imposed by federal, state, or local laws, rules, regulations, policies, or processes. Personnel must comply with whichever requirements are most confining.

This policy may not and does not override any applicable data privacy laws or data protection laws or any applicable regulations in any jurisdictions wherein the company operates and all such laws, regulations, and statutory requirements are considered to be binding in addition to this policy.

This policy specifically excludes employees of third-party sub-contractors who have explicit contractual relationships with the company to ensure their own employee non-disclosure and proper-use policies are enforced. Such exclusions will be noted by the legal team within the appropriate contractual relationshp and will be tracked in the contractor portal.

\begin{enumerate}
\item Exceptions:
\label{sec:org0bc8aa2}

On rare occasions it may be necessary to grant exceptions to this policy, in those instances Information Security may grant exceptions as per the general security exception policy.

\item Sanctions
\label{sec:org214eeec}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}

\item Expectations
\label{sec:org2579fab}

Personnel are expected to act lawfully and in compliance with all applicable regulations at all times. They are expected to exercise sound judgment and to not act in a way which may endanger the good name of the company or endanger the reputation of any company client, staff, providers, or other 3rd party entities. Personnel are expected to conform to the code of ethics at all times and to act with the best interest of the company in mind.

Specific prohibitions include:

\begin{itemize}
\item Any conduct that violates any Federal, State, or Local law, regulation, policy, or established ethical practice
\item Accessing the internet or technology for unlawful purposes (examples include violating copyright, or personal financial gain such as mining digital currency)
\item Accessing, downloading, or distributing pornographic, obscene, defamatory, discriminatory, harassing, or otherwise inappropriate materials
\item Installing, using, or accessing any third-party software or technology not approved by the company to store, transfer, or process company data or information
\item Conducting unauthorized vulnerability assessments, penetration tests, network probes or otherwise attempting to exploit, examine, or abuse system security measures
\item Gaining unauthorized access of any kind to any system or technology
\item Threaten the reputation of the company through personal actions which could be construed as libelous, slanderous, defamatory, threatening, exploitative, abusive, or otherwise inappropriate
\end{itemize}

\item Devices and Technology
\label{sec:orgf2ccd00}

\begin{enumerate}
\item Provisioning and Use
\label{sec:org416e534}

Only company provided and approved devices, systems, and technology will be connected to the company network and corporate systems. Any devices that is lost, stolen, or misplaced will be immediately reported to information security.

\item Using Devices
\label{sec:org44d21e9}

\begin{itemize}
\item Personnel are required to keep provided systems compliant with security policies, patches, software updates, configurations, encryption standards, patching levels, anti-virus signatures, data-loss prevention systems, etc. This list is non-exhaustive.
\item Any non-compliant configuration must be remediated within 5 business days or it will be disabled at the next automated system scan and will be required to be brought to the system security desk for re-enablement. This event will be noted in the employee personnel file.
\item Passwords and passcodes must meet the security standards published and maintained by the information security team.
\item Mobile devices are limited to being used for email, voice, instant messaging, and browser-based access to corproate vpn systems.
\item All devices must be encrypted
\item Devices wwith screen locks will have such locks enabled whenever not in use

\item Personal Use
Subject to the restrictions of this policy, personnel may use company provided devices for personal use provided such use:
\begin{itemize}
\item Does not interefere with on-going work
\item Does not adversely impact the proper handling of company data or information
\item Does not create adverse load on company network or technology assets
\end{itemize}
\end{itemize}
