TIM7040/week5/main.org
***** Physical Protection of Mobile Devices

- Unattended devices must be physically secured (e.g. with a cable lock) or securely stored (out of sight and in a locked container). This includes when the devices is in a private home.
- Privacy screens will be provided and used for mobile devices

**** Verification

Verification of the above will be conducted:

- Subject to applicable laws, all devices will be monitored and security software will be installed to allow for compliance checks to ensure that this policy is adhered to at all times.
- Regular security scans will be run to ensure that devices are compliant.
- Regular, unscheduled "walk about" audits to determine if devices are being used properly will be conducted.
- Network scanning will be conducted to monitor for irregular or unauthorized traffic.
- Other monitoring as determined reasonable and appropriate by Information Security will be conducted to ensure compliance.

*** Overall Responsibility

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Access Controls Standards Policy

- Applies to: All employees
- Policy Number: 003
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Information Security
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to utilizing computer and technology systems for information access and technology utilization.


*** Policy

**** Scope

This policy applies to all employees, contractors, and other workers. It establishes the minimum requirements for accessing, using, or interacting with any corporate owned, managed, or contracted device.

This policy specifically excludes employees of third-party sub-contractors who have explicit contractual relationships with the company to ensure their own employee non-disclosure and proper-use policies are enforced. Such exclusions will be noted by the legal team within the appropriate contractual relationship and will be tracked in the contractor portal.

***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here

**** Expectations

Systems that are managed by the corporation are expected to have a granular level of access management with the principle of least privilege. Invididuals must be granted the minimum set of permissions necessary to perform their assigned functions and nothing more. If a system can not be limited according to this principle, it must:

- Not have access to the external network
- Be provided specific exemption to be on the internal network
- Be engineered behind a firewall or other access control device that will limit access
- Be thoroughly documented as to the reason why no suitable alternative exists

Systems that need to be accessed by external personnel must be segregated into their own subnet and network traffic must be separated from internal traffic so as to ensure clear security controls are maintained.

Contractors and temporary employees must be assigned a sponsor who must be at manager level or higher and who is responsible for providing sign-off on all access requests. Access requests for such temporary employees must be renewed quarterly.

**** Verification

Verification of the above will be conducted:

- Subject to applicable laws, all devices will be monitored and security software will be installed to allow for compliance checks to ensure that this policy is adhered to at all times.
- Regular security scans will be run to ensure that devices are compliant.
- Network scanning will be conducted to monitor for irregular or unauthorized traffic.
- Other monitoring as determined reasonable and appropriate by Information Security will be conducted to ensure compliance.


*** Overall Responsibility

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Information Technology Planning Policy

- Applies to: All employees
- Policy Number: 004
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor:  Information Technology Architecture
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the introduction of new technology into the corporate network environment including associated virtual private cloud computing environments hosted by contracted cloud providers.

*** Policy

**** Scope

This policy applies to all individuals tasked with introducing new technology architectures or device types into the environment of the corporation.

***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here

Note: installing unapproved devices is a serious security breech that could jeopardize the company and its stakeholders greatly, actions less than immediate termination will require exigent circumstances.

**** Expectations

It is the expectation that no technology will be introduced into the network, VPCs, or otherwise connected into the corporate owned and controlled computing environment without first obtaining proper review and approval.

