TIM7040/week5/main.tex

\item Physical Protection of Mobile Devices
\label{sec:orgaface19}

\begin{itemize}
\item Unattended devices must be physically secured (e.g. with a cable lock) or securely stored (out of sight and in a locked container). This includes when the devices is in a private home.
\item Privacy screens will be provided and used for mobile devices
\end{itemize}
\end{enumerate}

\item Verification
\label{sec:org8c3a008}

Verification of the above will be conducted:

\begin{itemize}
\item Subject to applicable laws, all devices will be monitored and security software will be installed to allow for compliance checks to ensure that this policy is adhered to at all times.
\item Regular security scans will be run to ensure that devices are compliant.
\item Regular, unscheduled ``walk about'' audits to determine if devices are being used properly will be conducted.
\item Network scanning will be conducted to monitor for irregular or unauthorized traffic.
\item Other monitoring as determined reasonable and appropriate by Information Security will be conducted to ensure compliance.
\end{itemize}
\end{enumerate}

\subsubsection{Overall Responsibility}
\label{sec:org0dcc74c}

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Access Controls Standards Policy}
\label{sec:orgd01a907}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 003
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Information Security
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:org8ff5c12}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org8916dce}

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to utilizing computer and technology systems for information access and technology utilization.


\subsubsection{Policy}
\label{sec:orgbfb451a}

\begin{enumerate}
\item Scope
\label{sec:org3691ce8}

This policy applies to all employees, contractors, and other workers. It establishes the minimum requirements for accessing, using, or interacting with any corporate owned, managed, or contracted device.

This policy specifically excludes employees of third-party sub-contractors who have explicit contractual relationships with the company to ensure their own employee non-disclosure and proper-use policies are enforced. Such exclusions will be noted by the legal team within the appropriate contractual relationship and will be tracked in the contractor portal.

\begin{enumerate}
\item Sanctions
\label{sec:org525f42b}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}

\item Expectations
\label{sec:org092f16c}

Systems that are managed by the corporation are expected to have a granular level of access management with the principle of least privilege. Invididuals must be granted the minimum set of permissions necessary to perform their assigned functions and nothing more. If a system can not be limited according to this principle, it must:

\begin{itemize}
\item Not have access to the external network
\item Be provided specific exemption to be on the internal network
\item Be engineered behind a firewall or other access control device that will limit access
\item Be thoroughly documented as to the reason why no suitable alternative exists
\end{itemize}

Systems that need to be accessed by external personnel must be segregated into their own subnet and network traffic must be separated from internal traffic so as to ensure clear security controls are maintained.

Contractors and temporary employees must be assigned a sponsor who must be at manager level or higher and who is responsible for providing sign-off on all access requests. Access requests for such temporary employees must be renewed quarterly.

\item Verification
\label{sec:org4bbd990}

Verification of the above will be conducted:

\begin{itemize}
\item Subject to applicable laws, all devices will be monitored and security software will be installed to allow for compliance checks to ensure that this policy is adhered to at all times.
\item Regular security scans will be run to ensure that devices are compliant.
\item Network scanning will be conducted to monitor for irregular or unauthorized traffic.
\item Other monitoring as determined reasonable and appropriate by Information Security will be conducted to ensure compliance.
\end{itemize}
\end{enumerate}


\subsubsection{Overall Responsibility}
\label{sec:orga9afd41}

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Information Technology Planning Policy}
\label{sec:org8926eee}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 004
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor:  Information Technology Architecture
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:org26be483}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org39f2d93}

The purpose of this policy is to establish the requirements for the introduction of new technology into the corporate network environment including associated virtual private cloud computing environments hosted by contracted cloud providers.

\subsubsection{Policy}
\label{sec:org6c6bf83}

\begin{enumerate}
\item Scope
\label{sec:org738549e}

This policy applies to all individuals tasked with introducing new technology architectures or device types into the environment of the corporation.

\begin{enumerate}
\item Sanctions
\label{sec:org1f99ff3}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}

Note: installing unapproved devices is a serious security breech that could jeopardize the company and its stakeholders greatly, actions less than immediate termination will require exigent circumstances.
\end{enumerate}

\item Expectations
\label{sec:org982f2c6}

It is the expectation that no technology will be introduced into the network, VPCs, or otherwise connected into the corporate owned and controlled computing environment without first obtaining proper review and approval.
