TIM7040/week5/main.org
**** Approval Process

Devices for use within the environment shall be chosen from the Configuration Management Database (CMDB), which contains the listing of all approved device configurations for use within the corporate network environment, include cloud VPC environments. This list is maintained by the IT Architecture team and is updated at least quarterly according to their internal processes, but often more frequently as patches, security updates, and other configuration data is updated by manufacturers.

Requests for a new technology, device type, or system that is not currently part of the CMDB will be processed through the Architecture request portal. Approval will be subject to review for fitness according to criteria related to:

- Total cost of ownership
- Fitness to purpose
- Security standards
- Maintainability
- Available Alternatives
- etc.

Once approved, new devices may be ordered through the standard procurement system process request portal.

**** Technology Roadmap

Each year, Architecture will update the Technology Roadmap which will present the projected target technology state for the coming:

- year
- 3-year
- 5-year

time windows. WHile it is certainly the case that the 3- and 5-year projects are at best rough estimates, this roadmap provides a guidepost by which teams can plan for the future expansion. The 1-year roadmap will be maintained to include proven technologies that are available on the market today.

**** Verification

Verification of the above will be conducted:

- Regular system scans will be run against the CMDB to ensure that no unapproved devices are in the environment
- Any unapproved devices will be immediately quarantined from the network by automated processes for security reasons
- Any unapproved devices will be flagged as a severity 1 ticket for removal from the environment


*** Overall Responsibility

Overall responsibility for this policy is IT Architecture. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Hardware and Software Acquisition Standards Policy

- Applies to: All employees
- Policy Number: 005
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Purchasing
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the acquisition of hardware and software for the company.

*** Policy

**** Scope

This policy applies to all employees, manager level and above who have been assigned WBS accounts with purchasing signatory authority.


***** Exceptions:

On rare occasions it may be necessary to grant exceptions to this policy. It is recognized that the speed of business may mean that normal procurement channels may need to be bypassed in some exceptional circumstances. Managers otherwise authorized under this policy may obtain approval from a director level or higher to utilize their own judgment to bypass this policy and make purchases utilizing their corporate charge card to expedite a purchase. Such purchase are undertaken at the manager's own risk and should the purchase ultimately not be approved as a legitimate business expense, the manager will be fully personally liable for any such purchase. However, if approved, the manager will be fully reimbursed and no penalty will ensue. Purchases made in this manner will not be subject to sanctions outlined below. Sanctions are intended for willfully violating the policy, not attempting to expedite a purchase to meet a legitimate business need.

***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here

**** Project Related purchases

Project related purchases, which are line-item expenses from a project WBS budget will go through the normal RFQ and RFP processes as outlined by Purchasing depending on the size of the purchase in question. All such purchases will have the associated RFQ/RFP paperwork filed with the PMO as well as Purchasing, and will be included in quarterly forecast budget statements. No hardware or software may be purchased from a project WBS that is not part of the defined project scope. If a project needs items that are not already in scope, a change request must be filed with the PMO and any budget adjustments must first be applied prior to the filing of the RFQ/RFP.

If it is the case that the time delay for change request processing and the RFQ/RFP process will delay the project timeline and the manager's corporate card purchasing power is sufficient to cover the cost of the purchase and the items to be purchased are already contained in the CMDB, this is a case where the exception path outlined above may be authorized by a director-level or higher employee without the possibility of sanctions being imposed.

**** Non-Project Related Purchases

For non-project related purchases which are already in the normal purchase catalogue and CMDB, a request will be submitted through the purchasing web-store and routed to the employee's direct supervisor for approval. Once approved, purchasing will deliver the items from the warehouse if in stock and then resupply the warehouse as needed, or, if not in stock, will submit an order to an appropriate supplier on behalf of the employee.

**** All Project and Non-Project Purchases

All hardware will be item-tagged, and the tag numbers recorded in the configuration inventory database for tracking. Software purchases will have the software serial number or license number as applicable entered into the inventory database for tracking.

**** Verification

Verification of the above will be conducted:

- All hardware items will be subject to annual validation by hand inspection
- All software serial/license numbers will be subject to automated validation by security software scans

*** Overall Responsibility

Overall responsibility for this policy falls to Purchasing. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Electronic Communications Policy (Email, Social Media, etc..)

- Applies to: All employees
- Policy Number: 006
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Marketing
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

