TIM7040/week5/main.tex

\subsubsection{Nature of Revisions}
\label{sec:org1ab09fa}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org6746b90}

The purpose of this policy is to establish Rules and additional guidelines and suggestions for communications and utilizing social media. This policy applies to all social media, including personal social media accounts.


\subsubsection{Policy}
\label{sec:orgfa905e0}

\begin{enumerate}
\item Scope
\label{sec:org7359431}

This policy applies to all personnel. All personnel are responsible for the content that they post on-line. Before using social-media for professional or personal purposes, remember that everything one posts is or could become public. Keep in mind that user-generated online content can live forever, so one should be very discrete when generating such content or responding to the content of others.

Social media are digital platforms, technologies and practices that enable people to use, create, and share content, opinions, insights, experiences, and perspectives. Social media posts can take many forms including text, images, audio, video, and multimedia communications.

This policy applies to all social media, and for purposes of this policy,i external social media are social media sites that are generally public, including on-line blogs; forums; social networking sites such as Facebook, Twitter, and LinkedIn; video and image sharing websites such as TikTok, and YouTube; and any other public websites that allow users to post comments or content online. This includes access-restricted groups on public social media sites.

\begin{enumerate}
\item Sanctions
\label{sec:org69945dc}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}

\item Expectations
\label{sec:orgfce4fdd}

Personnel are expected to act and post in such a way as to comport to the code of ethics in the use of social media. Personnel are expected to follow all laws and regulations which may apply to them as well. Personnel are expected to:

\begin{itemize}
\item Company email accounts will be used for business purposes only
\item Company email will respect data privacy rules, and in particular will never send any documents to third-parties or over external network that are not encrypted.
\item Disclose you are employeed by the company if you post anything on social media related to the company or its business interests, including discussions of its services, clients, providers, etc.
\item Avoid attempts to hide or conceal your identity in order to make posts about the company, its business interests, its services, clients, providers, or third-party relationships.
\item Include a disclaimer noting your views do not represent the views of the company when speaking to topics where the company has a business interest.
\item Be careful to avoid the perception that you are speaking for the company on any topic.
\item Do not use your business email address with your personal social media accounts
\item Never post content that is abusive, malicious, violent, obscene, intimidating, harassing, containing of ethnic, religious, or racial slurs, discriminatory statements, or otherwise include anything in your posts that would reflect poorly upon the company
\item Under no circumstances discuss, disclose, or refer to the company's intellectual property interests
\item Comply with all company data security policies
\item Respect the privacy of your co-workers, providers, clients, and other business relationships
\item You should obtain permission to speak on behalf of the company before choosing to do so
\end{itemize}

It is to be understood that the company can and will act to protect the interest of the company. Irresponsible use of social media, even if it is your personal social media account, which reflects poorly upon the company, can result in disciplinary action.

\item Verification
\label{sec:org30960ce}

Verification of the above will be conducted:

\begin{itemize}
\item By scanning of company email using a variety of tools to ensure proper use and compliance with the above guidelines
\item By scanning of company networks using a variety of tools to ensure compliance with the above guidelines
\end{itemize}

While the company does not directly or specifically monitor personal social media accounts, the company does scan social media sites regularly for mentions of the company, and may encounter employees discussing the company from time to time. In such instances, decisions about if an employee is being responsible in discussing the company on their social media account can be made.
\end{enumerate}

\subsubsection{Overall Responsibility}
\label{sec:orgb548905}

Overall responsibility for this policy is Marketing and Communications. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Data Governance Policy}
\label{sec:org2d8d30a}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 007
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Information Security
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:orge6f8c75}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:orgb0483ff}

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security via data classification and governance.


\subsubsection{Policy}
\label{sec:org1c8a9ab}

\begin{enumerate}
\item Scope
\label{sec:org691f707}

This policy applies to all company and client data. 1

\begin{enumerate}
\item Exceptions:
\label{sec:orgf3cb53c}

On rare occasions where there are no contravening legal requirements it may be appropriate to grant an exception to certain requirements in this policy. In such cases, Legal has the authority to determine that Information Security has the authority to grant such an exception.

\item Sanctions
\label{sec:orgce4ea6e}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}

\item Classifications
\label{sec:org1e124ac}

\begin{enumerate}
\item Restricted
\label{sec:org19b4971}
