TIM7040/week5/main.org
***** Restricted

Restricted Data is highly sensitive, stategic data considered material, non-public data which an investor would very likely consider important in deciding whether to buy or sell company securities and which could effect the price of the security. Restricted data is also any data that is subject to any of the following regulations:

- Children's Online Privacy Protection Act
- Health Insurance Portability and Accounting Act
- Gramm Leach Bliley Act
- Fair Credit Reporting Act
- Any State Data Privacy Laws where the company is licensed as an Insurance Broker, Insurance Agent, Re-insurer of Record, Re-insuring Broker, or other Agent
- California Consumer Privacy Act
- California Privacy Rights Act
- Virginia Consumer Data Protection Act
- Colorado Privacy Act
- New York SHIELD Act
- The International General Data Protection Regulation (GDPR)

***** Highly Confidential Data

Highly Confidential Data is information not to be shared outside of the company and specific external third parties. Highly confidential data is intended for limited specific use by a department or group of individuals that need to know the information to do their jobs. In general, only authorized individuals should have access to this data.

***** Confidential Data

Confidential Data is data not intended to be shared outside of the company or with external parties unless there is a specific business need, but which is often of general utility within the company.

***** Unrestricted Data

Unrestricted data may be freely shared with anyone.


**** Responsibility for Classifications

Information in the asset register must be classified by the data governance board in accordance with the published data governance standards. These standards must be updated annually.

**** Controls

The following controls must be implemented for Data Governance and must be validated by the data governance board:

- Access and authentication: following the principle of least privilege
- Storage and transmission: ensuring encryption both in motion and at rest for all non-public data
- Backup, retention, and disposal: ensuring that all data in the asset register is backed up on a schedule appropriate to its sensativity and business value

**** Verification

Verification of the above will be conducted:

- Regular security scans will be run to ensure that data stores are compliant with the above
- Other monitoring as determined reasonable and appropriate by Information Security will be conducted to ensure compliance.

*** Overall Responsibility

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Electronic Signature Policy

- Applies to: All employees
- Policy Number: 008
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Human Resources
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to electronic signatures.


*** Policy

**** Scope

This policy applies to all employees and how electronic signatures will be handled.
***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here

**** Expectations

Personnel will have Adobe suite installed and configured with Adobe Sign on their personal-use devices. As part of on-boarding, all employees will create a employee electronic signature that will be on file with HR. These are legally biding signatures for use in electronic documents.

The company will take care of all license and upkeep costs to ensure that the signature records are maintained in accordance with the Electronic Identification and Trust Services Regulation (eIDAS) Act of 2016. Which superseded the ESIGN Act of 2000.

All legal documents requiring a signature will be signed using these electronic signatures.

**** Verification

Verification of the above will be conducted by HR as part of the on-boarding process. Periodically by Legal as part of compliance audits.


*** Overall Responsibility

Overall responsibility for this policy is Human Resources. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Change Management Policy

- Applies to: All employees
- Policy Number: 009
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Project Management Office
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for Change Management in the company.


*** Policy

**** Scope

This policy applies to all projects engaging in changes in the environment.

***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here

