TIM7040/week5/main.tex

Restricted Data is highly sensitive, stategic data considered material, non-public data which an investor would very likely consider important in deciding whether to buy or sell company securities and which could effect the price of the security. Restricted data is also any data that is subject to any of the following regulations:

\begin{itemize}
\item Children's Online Privacy Protection Act
\item Health Insurance Portability and Accounting Act
\item Gramm Leach Bliley Act
\item Fair Credit Reporting Act
\item Any State Data Privacy Laws where the company is licensed as an Insurance Broker, Insurance Agent, Re-insurer of Record, Re-insuring Broker, or other Agent
\item California Consumer Privacy Act
\item California Privacy Rights Act
\item Virginia Consumer Data Protection Act
\item Colorado Privacy Act
\item New York SHIELD Act
\item The International General Data Protection Regulation (GDPR)
\end{itemize}

\item Highly Confidential Data
\label{sec:orgd086e2a}

Highly Confidential Data is information not to be shared outside of the company and specific external third parties. Highly confidential data is intended for limited specific use by a department or group of individuals that need to know the information to do their jobs. In general, only authorized individuals should have access to this data.

\item Confidential Data
\label{sec:org65fe5ba}

Confidential Data is data not intended to be shared outside of the company or with external parties unless there is a specific business need, but which is often of general utility within the company.

\item Unrestricted Data
\label{sec:org6ee411b}

Unrestricted data may be freely shared with anyone.
\end{enumerate}


\item Responsibility for Classifications
\label{sec:org68f116d}

Information in the asset register must be classified by the data governance board in accordance with the published data governance standards. These standards must be updated annually.

\item Controls
\label{sec:org97cef61}

The following controls must be implemented for Data Governance and must be validated by the data governance board:

\begin{itemize}
\item Access and authentication: following the principle of least privilege
\item Storage and transmission: ensuring encryption both in motion and at rest for all non-public data
\item Backup, retention, and disposal: ensuring that all data in the asset register is backed up on a schedule appropriate to its sensativity and business value
\end{itemize}

\item Verification
\label{sec:orgcee0b85}

Verification of the above will be conducted:

\begin{itemize}
\item Regular security scans will be run to ensure that data stores are compliant with the above
\item Other monitoring as determined reasonable and appropriate by Information Security will be conducted to ensure compliance.
\end{itemize}
\end{enumerate}

\subsubsection{Overall Responsibility}
\label{sec:orgff93843}

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Electronic Signature Policy}
\label{sec:org3e71001}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 008
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Human Resources
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:orgb099993}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org1b13575}

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to electronic signatures.


\subsubsection{Policy}
\label{sec:org9d9dc39}

\begin{enumerate}
\item Scope
\label{sec:org84727bd}

This policy applies to all employees and how electronic signatures will be handled.
\begin{enumerate}
\item Sanctions
\label{sec:org19d9340}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}

\item Expectations
\label{sec:org77a0bcd}

Personnel will have Adobe suite installed and configured with Adobe Sign on their personal-use devices. As part of on-boarding, all employees will create a employee electronic signature that will be on file with HR. These are legally biding signatures for use in electronic documents.

The company will take care of all license and upkeep costs to ensure that the signature records are maintained in accordance with the Electronic Identification and Trust Services Regulation (eIDAS) Act of 2016. Which superseded the ESIGN Act of 2000.

All legal documents requiring a signature will be signed using these electronic signatures.

\item Verification
\label{sec:org279954e}

Verification of the above will be conducted by HR as part of the on-boarding process. Periodically by Legal as part of compliance audits.
\end{enumerate}


\subsubsection{Overall Responsibility}
\label{sec:org17f3dfb}

Overall responsibility for this policy is Human Resources. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Change Management Policy}
\label{sec:org247fb9a}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 009
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Project Management Office
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:org348a638}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org2b19379}

The purpose of this policy is to establish the requirements for Change Management in the company.
