TIM7040/week5/main.org
**** Expectations


As this is a fully Agile DevSecOps environment, traditional Change Management is not practiced here. Each Agile DevOps team is responsible for their own production environment where a practice of continuous automated test/release is practiced.

The following standards will be adhered to:

1. Each Product Manager will establish the Availability target for their service product in terms of a number of 9's. For example 3-9's would be 99.9% availability.
2. Each Availability target will take into account the user bases' ability to detect unavailability. For example, typical ISP's have an availability range of between 2-9s and 2.5 9's. So availability much higher than that is wasted opportunity cost.
3. From the Availability target, each team will establish an "Error Budget," the amount of time a system is allowed to be down for any reason, from feature release to failure over any time period.
4. The Product Manager will establish appropriate Service Level Indicators and Service LEvel Objectives to measure and monitor adherence to the Availability target and Error Budget.
5. The DevOps team will be free to release on-demand to production so-long as the error-budget is not exceeded during any given time window.
6. Any code released to production will have gone through the following gates:
   a. An Automated Build Pipeline with compliance checks for coding standards
   b. An Automated testing Pipeline with full Unit and Regression testing
   c. An Automated release Pipeline with full security checks for security and governance standards
7. Once the error budget is broached, no more releases will be permitted until the error budget is replenished.

**** Verification

Verification of the above will be conducted:

- Dashboards will exist for each service tracking SLO's for all established SLI's
- Product Managers will report on their Availability targets and Error Budget management at weekly PMO meetings

*** Overall Responsibility

Overall responsibility for this policy is the PMO. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Media Protection and Disposal Policy

- Applies to: All employees
- Policy Number: 010
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Information Security
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security related to disposal of data devices.


*** Policy

**** Scope

This policy applies to all the disposal of all data containing hardware devices.

***** Sanctions

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

- A notification of policy violation in personnel file
- A limitation on compensation increases for the current rewards cycle
- Removal of access from one or more information systems
- Termination
- Legal action
- Referral to professional boards for disciplinary action
- Other actions not listed here


**** Expectations

1. No removable media will be used internally within the company. Removable media may be used for permitted transfers of data external to the company. When removable media is on site, it must be secured at all times in locked containers or locked rooms (depending on the size and scale). If removable media is received from an external site, once the data has been extracted, it will be erased following a standard process and then handed over to information security for destruction.
2. Device Disposal. All devices will be handed over to Information Security for disposal. IS will wipe the devices clean if possible. The devices will be sent to a contracted 3rd party bonded reclamation company with the responsibility of securely disposing of the equipment such that no data is recoverable from the systems.

**** Verification

Verification of the above will be conducted:

- Audit will review records of device disposal to ensure the third-party service provider is following procedures appropriately

*** Overall Responsibility

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

** Security Awareness and Training Policy

- Applies to: All employees
- Policy Number: 011
- Effective Date of This Version: 28-Aug-2021
- Supersedes the Version Dated: N/A
- Policy Sponsor: Information Security
- Original Effective Date: 28-Aug-2021

*** Nature of Revisions

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases cite:wagleDevelopmentEffectiveCentralized2021.

*** Purpose of the Policy

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security, information access, device access, and technology utilization through the communication of policies to internal employees.


*** Policy

**** Scope

This policy applies to all employees, contractors, and other workers.

**** Expectations

Personnel are expected to be fully versed in best-practices for IT security, including being prepared to resist social engineering attacks. As well as being able to recognize common exploits such as phishing attacks, spam emails, and other common attacks. Further, personnel are expected to understand how to ensure that their devices are in compliance with the latest security configurations and to remediate their devices if their devices are found to not be in compliance.

