TIM7040/week5/main.tex


\subsubsection{Policy}
\label{sec:org4c6aa5a}

\begin{enumerate}
\item Scope
\label{sec:org4182db6}

This policy applies to all projects engaging in changes in the environment.

\begin{enumerate}
\item Sanctions
\label{sec:org97a93f3}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}

\item Expectations
\label{sec:org7c17f17}


As this is a fully Agile DevSecOps environment, traditional Change Management is not practiced here. Each Agile DevOps team is responsible for their own production environment where a practice of continuous automated test/release is practiced.

The following standards will be adhered to:

\begin{enumerate}
\item Each Product Manager will establish the Availability target for their service product in terms of a number of 9's. For example 3-9's would be 99.9\% availability.
\item Each Availability target will take into account the user bases' ability to detect unavailability. For example, typical ISP's have an availability range of between 2-9s and 2.5 9's. So availability much higher than that is wasted opportunity cost.
\item From the Availability target, each team will establish an ``Error Budget,'' the amount of time a system is allowed to be down for any reason, from feature release to failure over any time period.
\item The Product Manager will establish appropriate Service Level Indicators and Service LEvel Objectives to measure and monitor adherence to the Availability target and Error Budget.
\item The DevOps team will be free to release on-demand to production so-long as the error-budget is not exceeded during any given time window.
\item Any code released to production will have gone through the following gates:
\begin{enumerate}
\item An Automated Build Pipeline with compliance checks for coding standards
\item An Automated testing Pipeline with full Unit and Regression testing
\item An Automated release Pipeline with full security checks for security and governance standards
\end{enumerate}
\item Once the error budget is broached, no more releases will be permitted until the error budget is replenished.
\end{enumerate}

\item Verification
\label{sec:org3768d8c}

Verification of the above will be conducted:

\begin{itemize}
\item Dashboards will exist for each service tracking SLO's for all established SLI's
\item Product Managers will report on their Availability targets and Error Budget management at weekly PMO meetings
\end{itemize}
\end{enumerate}

\subsubsection{Overall Responsibility}
\label{sec:org45b02fc}

Overall responsibility for this policy is the PMO. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Media Protection and Disposal Policy}
\label{sec:org91b3a0c}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 010
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Information Security
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:orge03d3eb}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org0b1bdd7}

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security related to disposal of data devices.


\subsubsection{Policy}
\label{sec:orgda9769f}

\begin{enumerate}
\item Scope
\label{sec:orgd6cd207}

This policy applies to all the disposal of all data containing hardware devices.

\begin{enumerate}
\item Sanctions
\label{sec:orge4e3a17}

Any personnel who violates this policy will be referred to HR for disciplinary action. Such action may include but is not limited to:

\begin{itemize}
\item A notification of policy violation in personnel file
\item A limitation on compensation increases for the current rewards cycle
\item Removal of access from one or more information systems
\item Termination
\item Legal action
\item Referral to professional boards for disciplinary action
\item Other actions not listed here
\end{itemize}
\end{enumerate}


\item Expectations
\label{sec:org21272c0}

\begin{enumerate}
\item No removable media will be used internally within the company. Removable media may be used for permitted transfers of data external to the company. When removable media is on site, it must be secured at all times in locked containers or locked rooms (depending on the size and scale). If removable media is received from an external site, once the data has been extracted, it will be erased following a standard process and then handed over to information security for destruction.
\item Device Disposal. All devices will be handed over to Information Security for disposal. IS will wipe the devices clean if possible. The devices will be sent to a contracted 3rd party bonded reclamation company with the responsibility of securely disposing of the equipment such that no data is recoverable from the systems.
\end{enumerate}

\item Verification
\label{sec:orgeb93129}

Verification of the above will be conducted:

\begin{itemize}
\item Audit will review records of device disposal to ensure the third-party service provider is following procedures appropriately
\end{itemize}
\end{enumerate}

\subsubsection{Overall Responsibility}
\label{sec:orgf3920af}

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.

\subsection{Security Awareness and Training Policy}
\label{sec:org473a0a6}

\begin{itemize}
\item Applies to: All employees
\item Policy Number: 011
\item Effective Date of This Version: 28-Aug-2021
\item Supersedes the Version Dated: N/A
\item Policy Sponsor: Information Security
\item Original Effective Date: 28-Aug-2021
\end{itemize}

\subsubsection{Nature of Revisions}
\label{sec:orgfa83bc1}

28-Aug-2021: This is the initial version of this policy written from a perspective of a unified corporate policy. Prior policy covering this topic was written at a department level. All such department level policies must meet the minimum standards set forth in this policy from the effective date of this policy. This revision has proceeded through the documented centralized IT business process management system including all review phases \cite{wagleDevelopmentEffectiveCentralized2021}.

\subsubsection{Purpose of the Policy}
\label{sec:org453f311}

The purpose of this policy is to establish the requirements for the protection of the corporation, its clients, stakeholders, legal relationships, and other third-parties with respect to information and data security, information access, device access, and technology utilization through the communication of policies to internal employees.


\subsubsection{Policy}
\label{sec:org2f2da03}

\begin{enumerate}
\item Scope
\label{sec:orgc126520}

This policy applies to all employees, contractors, and other workers.

\item Expectations
\label{sec:orgbae4cba}

Personnel are expected to be fully versed in best-practices for IT security, including being prepared to resist social engineering attacks. As well as being able to recognize common exploits such as phishing attacks, spam emails, and other common attacks. Further, personnel are expected to understand how to ensure that their devices are in compliance with the latest security configurations and to remediate their devices if their devices are found to not be in compliance.
