TIM7040/week5/main.org
**** Training requirements

The Information Security will coordinate with the training department to provide for the following minimum training with respect to security. A number of these will need coordination with other entities.

- Quarterly training on corporate security policies and industry best-practices
- Regular faux phishing attacks and other faux attacks to attempt to educate employees about common exploits
- Regular faux social engineering attacks to attempt to educate employees about common exploits
- Regular "red team" physical and virtual penetration attacks utilizing a contracted specialty company that focuses on "red team" exploits.
- Ad hoc speakers, town halls and other events on security topics related to Information Security and the Health Care industry


**** Verification

Verification of the above will be conducted:

- Scores for each employees training results will be part of the employee record
- Failures faux attacks will result in remedial training for employees
- Failures of red-team attacks will result in remedial training for responsible directors and managers

*** Overall Responsibility

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.


#+LATEX: \newpage


* References
  :PROPERTIES:
  :UNNUMBERED: t
  :NEWPAGE: t
  :END:
  #+LaTeX: \printbibliography[heading=none]
