TIM7040/week5/main.tex

\item Training requirements
\label{sec:org6e27189}

The Information Security will coordinate with the training department to provide for the following minimum training with respect to security. A number of these will need coordination with other entities.

\begin{itemize}
\item Quarterly training on corporate security policies and industry best-practices
\item Regular faux phishing attacks and other faux attacks to attempt to educate employees about common exploits
\item Regular faux social engineering attacks to attempt to educate employees about common exploits
\item Regular ``red team'' physical and virtual penetration attacks utilizing a contracted specialty company that focuses on ``red team'' exploits.
\item Ad hoc speakers, town halls and other events on security topics related to Information Security and the Health Care industry
\end{itemize}


\item Verification
\label{sec:orgf68c260}

Verification of the above will be conducted:

\begin{itemize}
\item Scores for each employees training results will be part of the employee record
\item Failures faux attacks will result in remedial training for employees
\item Failures of red-team attacks will result in remedial training for responsible directors and managers
\end{itemize}
\end{enumerate}

\subsubsection{Overall Responsibility}
\label{sec:org6f55868}

Overall responsibility for this policy is Information Security. General questions about this policy can be directed to the Help Desk. Legal questions about this policy can be directed to the legal team.


\newpage


\section*{References}
\label{sec:org6502000}
\printbibliography[heading=none]
\end{document}
